# -*- coding: utf-8 -*-

from chatterbot import ChatBot

from random import randint
from time import sleep

response_bot = ChatBot(
    'Charlie',
    storage_adapter = 'chatterbot.storage.SQLStorageAdapter',
    logic_adapters = [
        {'import_path' : 'chatterbot.logic.BestMatch'},
        # Адаптор слабой уверенности
        {'import_path' : 'chatterbot.logic.LowConfidenceAdapter',
         'treshold' : 0.1,
         'default_response' : 'Вибачте, я не знаю відповіді'
         }
    ],

    trainer = 'chatterbot.trainers.ListTrainer'
)

response_bot.train(
    [
        'Оптика',
        'Оптика - це розділ фізики, який вивчає оптичне випромінювання, процеси його розповсюдження та взаємодії з речовиною',
        'Фізична оптика',
        'Фізична оптика вивчає питання, природи світла та оптичних явищ',
        'Основні закони розповсюдження світла',
        'Закон прямолінійного розповсюдження, Закон незалежного розповсюдження, Закон відбиття світла, Закон заломлення світла',
        'Точка, що світиться',
        'Нескінченно мале джерело світла, яке не має розмірів',
        'Світловий промінь',
        'Геометрична лінія, яка не має розмірів у поперечному перерізі',
        'Геометрична оптика',
        'Розділ оптики, в якому використовуються уявлення про світлові промені, вздовж яких розповсюджується енергія світлових коливань',
        'Світловий пучок',
        'Сукупність світлових променів',
        'Гомоцентричний пучок променів',
        'Гомоцентричний пучок - це пучок променів, що мають спільну точку перетину',
        'Оптична система',
        'Оптична система - це сукупність оптичних елементів, розташованих певним чином, що призначена для формування пучків світлових променів',
        'Оптична вісь',
        'Оптична вісь - це вісь симетрії оптичної системи, напрямок якої співпадає з напрямком розповсюдження світла',
        'Спряжені точки',
        'Дві точки, одна з яких є зображенням іншої',
        'Передній фокус',
        'Передній фокус - це точка на оптичній осі в просторі предметів, яка спряжена с нескінченно віддаленою точкою, розташованою на оптичній осі в просторі зображень',
        'Задній фокус',
        'Задній фокус - це точка на оптичній осі в прсторі зображень, яка спряжена з нескінченно віддаленою точкою, розташованою на оптичній осі в просторі предметів',
        'Передня фокальна площина',
        'Це площина, що перпендикулярна до оптичної осі та проходить крізь точку переднього фокусу',
        'Правило знаків',
        'Це правила визначення знаків величин та напрямків, прийняті при розрахунку оптичних систем, а також при кресленні та читанні оптичних схем'
    ]
)

while True:
    try:
        question = input('Запитай у мене щось з оптики: ')
        response = response_bot.get_response(question)
        sleep(randint(1, 5))
        print(response)

    except(KeyboardInterrupt, EOFError, SystemExit):
        break
